// œ–Ë‚ÂÚ ‚‡Ï

//***********************************************************************
—Ú‡ÙËÎÓÍÓÍÍÛÒ ‡ÛÂÛÒ
8697,7270,1050,999,943,824,787,784,745,738,728,727,647,644,555,478,424
—Ú‡ÙËÎÓÍÓÍÍ ÍÓ‡„ÛÎÓ ÔÓÁËÚË‚Ì˚È
643
—Ú‡ÙËÎÓÍÓÍÍ ÍÓÏÔÎÂÍÒÌ˚È
9646,8697,7270,7160,2600,2431,1902,1109,1089,1060,1050,1010,999,985,960,958,943,934,884,882,880,878,876,824.4,
787,786,784,745,738,728,727,718,686,678,674,647,644,643,639,634,576,563,555,550,542,478,453,436,424,423,411,333,134,128
—Ú‡ÙËÎÓÍÓÍÍÓ‚‡ˇ ËÌÙÂÍˆËˇ
960,727,786,453,678,674,550,1109,424,943,1050,643,2600,7160,639,1089,8697,
—Ú‡ÙËÎÓÍÓÍÓ-ÒÚÂÔÚÓÍÓÍÓ‚‡ˇ ËÌÙÂÍˆËˇ
9646,7160,2431,1902,1109,1060,1050,1010,985,958,934,786,727,718,686,643,576,563,542,453,436,423,411,333,134,128,




//***********************************************************************
const uint8_t pg_09[] PROGMEM = "√–»¡€,œÀ≈—.ƒ–Œ∆";

const uint8_t n09_01[] PROGMEM = "Aflatoxin";
const float f09_01[] PROGMEM = { 177190, 0, 177190, 0, 177190 };
#define L09_01	( ( 60 * 4 ) | FREQ_MEANDR )

const uint8_t n09_02[] PROGMEM = "Besnoitia";
const float f09_02[] PROGMEM = {
352800.00, 353252.63, 353705.26, 354157.89, 354610.53,
355063.16, 355515.79, 355968.42, 356421.05, 356873.68,
357326.32, 357778.95, 358231.58, 358684.21, 359136.84,
359589.47, 360042.11, 360494.74, 360947.37, 361400.00
};
#define L09_02	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n09_03[] PROGMEM = "Cytochalasin ¬";
const float f09_03[] PROGMEM = { 77000, 0, 77000, 0, 77000 };
#define L09_03	( ( 60 * 4 ) | FREQ_MEANDR )

const uint8_t n09_04[] PROGMEM = "Cytochalasin ¬2";
const float f09_04[] PROGMEM = { 91000, 0, 91000, 0, 91000 };
#define L09_04	( ( 60 * 4 ) | FREQ_MEANDR )

const uint8_t n09_05[] PROGMEM = "Ergot";
const float f09_05[] PROGMEM = { 295000, 0, 295000, 0, 295000 };
#define L09_05	( ( 60 * 4 ) | FREQ_MEANDR )

const uint8_t n09_06[] PROGMEM = "Ergot";
const float f09_06[] PROGMEM = { 295000, 0, 295000, 0, 295000 };
#define L09_06	( ( 60 * 4 ) | FREQ_MEANDR )

const uint8_t n09_07[] PROGMEM = "Griseofulvin";
const float f09_07[] PROGMEM = { 288000, 0, 288000, 0, 288000 };
#define L09_07	( ( 60 * 4 ) | FREQ_MEANDR )

const uint8_t n09_08[] PROGMEM = "Histopl.capsula";
const float f09_08[] PROGMEM = {
298300.00, 298644.74, 298989.47, 299334.21, 299678.95,
300023.68, 300368.42, 300713.16, 301057.89, 301402.63,
301747.37, 302092.11, 302436.84, 302781.58, 303126.32,
303471.05, 303815.79, 304160.53, 304505.26, 304850.00
};
#define L09_08	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n09_09[] PROGMEM = "Myxosoma";
const float f09_09[] PROGMEM = {
409600.00, 409986.84, 410373.68, 410760.53, 411147.37,
411534.21, 411921.05, 412307.89, 412694.74, 413081.58,
413468.42, 413855.26, 414242.11, 414628.95, 415015.79,
415402.63, 415789.47, 416176.32, 416563.16, 416950.00
};
#define L09_09	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n09_10[] PROGMEM = "Pneumocys.carni";
const float f09_10[] PROGMEM = {
405750.00, 405928.95, 406107.89, 406286.84, 406465.79,
406644.74, 406823.68, 407002.63, 407181.58, 407360.53,
407539.47, 407718.42, 407897.37, 408076.32, 408255.26,
408434.21, 408613.16, 408792.11, 408971.05, 409150.00
};
#define L09_10	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n09_11[] PROGMEM = "Sorghum syrup";
const float f09_11[] PROGMEM = { 277000, 0, 277000, 0, 277000 };
#define L09_11	( ( 60 * 4 ) | FREQ_MEANDR )

const uint8_t n09_12[] PROGMEM = "Sterigmatocyst.";
const float f09_12[] PROGMEM = { 88000, 96000, 126000, 133000 };
#define L09_12	( ( 60 * 5 ) | FREQ_MEANDR )

const uint8_t n09_13[] PROGMEM = "Zearalenone";
const float f09_13[] PROGMEM = { 100000, 0, 100000, 0, 100000 };
#define L09_13	( ( 60 * 4 ) | FREQ_MEANDR )

const uint8_t n09_14[] PROGMEM = "Arcyria";
const float f09_14[] PROGMEM = { 81000, 0, 81000, 0, 81000 };
#define L09_14	( ( 60 * 4 ) | FREQ_MEANDR )

const uint8_t n09_15[] PROGMEM = "Lycogala";
const float f09_15[] PROGMEM = { 126000, 0, 126000, 0, 126000 };
#define L09_15	( ( 60 * 4 ) | FREQ_MEANDR )

const uint8_t n09_16[] PROGMEM = "Stemonitis";
const float f09_16[] PROGMEM = { 211000, 0, 211000, 0, 211000 };
#define L09_16	( ( 60 * 4 ) | FREQ_MEANDR )

const uint8_t n09_17[] PROGMEM = "Candida albican";
const float f09_17[] PROGMEM = {
384200.00, 384421.05, 384642.11, 384863.16, 385084.21,
385305.26, 385526.32, 385747.37, 385968.42, 386189.47,
386410.53, 386631.58, 386852.63, 387073.68, 387294.74,
387515.79, 387736.84, 387957.89, 388178.95, 388400.00
};
#define L09_17	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t * const pg_n09[] PROGMEM = { n09_01, n09_02, n09_03, n09_04, n09_05, n09_06, n09_07, n09_08, n09_09, n09_10, n09_11, n09_12, n09_13, n09_14, n09_15, n09_16, n09_17, (uint8_t *)0 };
const float * const pg_f09[] PROGMEM = { f09_01, f09_02, f09_03, f09_04, f09_05, f09_06, f09_07, f09_08, f09_09, f09_10, f09_11, f09_12, f09_13, f09_14, f09_15, f09_16, f09_17 };
const uint8_t pg_j09[] PROGMEM = { S(f09_01), S(f09_02), S(f09_03), S(f09_04), S(f09_05), S(f09_06), S(f09_07), S(f09_08), S(f09_09), S(f09_10), S(f09_11), S(f09_12), S(f09_13), S(f09_14), S(f09_15), S(f09_16), S(f09_17) };
const uint16_t pg_t09[] PROGMEM = { L09_01, L09_02, L09_03, L09_04, L09_05, L09_06, L09_07, L09_08, L09_09, L09_10, L09_11, L09_12, L09_13, L09_14, L09_15, L09_16, L09_17 };

//***********************************************************************
const uint8_t pg_10[] PROGMEM = "¬»–”—€";

const uint8_t n10_01[] PROGMEM = "Adenovirus";
const float f10_01[] PROGMEM = { 393000, 0, 393000, 0, 393000 };
#define L10_01	( ( 60 * 4 ) | FREQ_MEANDR )

const uint8_t n10_02[] PROGMEM = "Adenovirus 2nd";
const float f10_02[] PROGMEM = {
371450.00, 372263.16, 373076.32, 373889.47, 374702.63,
375515.79, 376328.95, 377142.11, 377955.26, 378768.42,
379581.58, 380394.74, 381207.89, 382021.05, 382834.21,
383647.37, 384460.53, 385273.68, 386086.84, 386900.00
};
#define L10_02	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_03[] PROGMEM = "Coxsackie vr.B1";
const float f10_03[] PROGMEM = {
360500.00, 360794.74, 361089.47, 361384.21, 361678.95,
361973.68, 362268.42, 362563.16, 362857.89, 363152.63,
363447.37, 363742.11, 364036.84, 364331.58, 364626.32,
364921.05, 365215.79, 365510.53, 365805.26, 366100.00
};
#define L10_03	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_04[] PROGMEM = "Coxsackie vr.B4";
const float f10_04[] PROGMEM = {
361450.00, 361568.42, 361686.84, 361805.26, 361923.68,
362042.11, 362160.53, 362278.95, 362397.37, 362515.79,
362634.21, 362752.63, 362871.05, 362989.47, 363107.89,
363226.32, 363344.74, 363463.16, 363581.58, 363700.00
};
#define L10_04	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_05[] PROGMEM = "Coxsackie B4-2";
const float f10_05[] PROGMEM = {
363900.00, 363952.63, 364005.26, 364057.89, 364110.53,
364163.16, 364215.79, 364268.42, 364321.05, 364373.68,
364426.32, 364478.95, 364531.58, 364584.21, 364636.84,
364689.47, 364742.11, 364794.74, 364847.37, 364900.00
};
#define L10_05	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_06[] PROGMEM = "Cytomegalovirus";
const float f10_06[] PROGMEM = {
408350.00, 408476.32, 408602.63, 408728.95, 408855.26,
408981.58, 409107.89, 409234.21, 409360.53, 409486.84,
409613.16, 409739.47, 409865.79, 409992.11, 410118.42,
410244.74, 410371.05, 410497.37, 410623.68, 410750.00
};
#define L10_06	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_07[] PROGMEM = "Epstein Barre";
const float f10_07[] PROGMEM = {
372500.00, 373044.74, 373589.47, 374134.21, 374678.95,
375223.68, 375768.42, 376313.16, 376857.89, 377402.63,
377947.37, 378492.11, 379036.84, 379581.58, 380126.32,
380671.05, 381215.79, 381760.53, 382305.26, 382850.00
};
#define L10_07	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_08[] PROGMEM = "Hepatit.¬ antig";
const float f10_08[] PROGMEM = {
414550.00, 414878.95, 415207.89, 415536.84, 415865.79,
416194.74, 416523.68, 416852.63, 417181.58, 417510.53,
417839.47, 418168.42, 418497.37, 418826.32, 419155.26,
419484.21, 419813.16, 420142.11, 420471.05, 420800.00
};
#define L10_08	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_09[] PROGMEM = "Herpes simplex1";
const float f10_09[] PROGMEM = {
291250.00, 291344.74, 291439.47, 291534.21, 291628.95,
291723.68, 291818.42, 291913.16, 292007.89, 292102.63,
292197.37, 292292.11, 292386.84, 292481.58, 292576.32,
292671.05, 292765.79, 292860.53, 292955.26, 293050.00
};
#define L10_09	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_10[] PROGMEM = "Herpes simp.1-2";
const float f10_10[] PROGMEM = {
345350.00, 345371.05, 345392.11, 345413.16, 345434.21,
345455.26, 345476.32, 345497.37, 345518.42, 345539.47,
345560.53, 345581.58, 345602.63, 345623.68, 345644.74,
345665.79, 345686.84, 345707.89, 345728.95, 345750.00
};
#define L10_10	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_11[] PROGMEM = "Herpes simp.2-s";
const float f10_11[] PROGMEM = {
353900.00, 354373.68, 354847.37, 355321.05, 355794.74,
356268.42, 356742.11, 357215.79, 357689.47, 358163.16,
358636.84, 359110.53, 359584.21, 360057.89, 360531.58,
361005.26, 361478.95, 361952.63, 362426.32, 362900.00
};
#define L10_11	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_12[] PROGMEM = "Herpes Zoster";
const float f10_12[] PROGMEM = {
416600.00, 416789.47, 416978.95, 417168.42, 417357.89,
417547.37, 417736.84, 417926.32, 418115.79, 418305.26,
418494.74, 418684.21, 418873.68, 419063.16, 419252.63,
419442.11, 419631.58, 419821.05, 420010.53, 420200.00
};
#define L10_12	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_13[] PROGMEM = "Influenza A&¬";
const float f10_13[] PROGMEM = {
313350.00, 313905.26, 314460.53, 315015.79, 315571.05,
316126.32, 316681.58, 317236.84, 317792.11, 318347.37,
318902.63, 319457.89, 320013.16, 320568.42, 321123.68,
321678.95, 322234.21, 322789.47, 323344.74, 323900.00
};
#define L10_13	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_14[] PROGMEM = "Measles antigen";
const float f10_14[] PROGMEM = {
369500.00, 369684.21, 369868.42, 370052.63, 370236.84,
370421.05, 370605.26, 370789.47, 370973.68, 371157.89,
371342.11, 371526.32, 371710.53, 371894.74, 372078.95,
372263.16, 372447.37, 372631.58, 372815.79, 373000.00
};
#define L10_14	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_15[] PROGMEM = "Mumps antigen";
const float f10_15[] PROGMEM = {
377600.00, 377971.05, 378342.11, 378713.16, 379084.21,
379455.26, 379826.32, 380197.37, 380568.42, 380939.47,
381310.53, 381681.58, 382052.63, 382423.68, 382794.74,
383165.79, 383536.84, 383907.89, 384278.95, 384650.00
};
#define L10_15	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_16[] PROGMEM = "Respirat.syncyt";
const float f10_16[] PROGMEM = {
378950.00, 379171.05, 379392.11, 379613.16, 379834.21,
380055.26, 380276.32, 380497.37, 380718.42, 380939.47,
381160.53, 381381.58, 381602.63, 381823.68, 382044.74,
382265.79, 382486.84, 382707.89, 382928.95, 383150.00
};
#define L10_16	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t n10_17[] PROGMEM = "Tobacco mosaic";
const float f10_17[] PROGMEM = {
427150.00, 427276.32, 427402.63, 427528.95, 427655.26,
427781.58, 427907.89, 428034.21, 428160.53, 428286.84,
428413.16, 428539.47, 428665.79, 428792.11, 428918.42,
429044.74, 429171.05, 429297.37, 429423.68, 429550.00,
};
#define L10_17	( ( 60 * 1 ) | FREQ_MEANDR )

const uint8_t * const pg_n10[] PROGMEM = { n10_01, n10_02, n10_03, n10_04, n10_05, n10_06, n10_07, n10_08, n10_09, n10_10, n10_11, n10_12, n10_13, n10_14, n10_15, n10_16, n10_17, (uint8_t *)0 };
const float * const pg_f10[] PROGMEM = { f10_01, f10_02, f10_03, f10_04, f10_05, f10_06, f10_07, f10_08, f10_09, f10_10, f10_11, f10_12, f10_13, f10_14, f10_15, f10_16, f10_17 };
const uint8_t pg_j10[] PROGMEM = { S(f10_01), S(f10_02), S(f10_03), S(f10_04), S(f10_05), S(f10_06), S(f10_07), S(f10_08), S(f10_09), S(f10_10), S(f10_11), S(f10_12), S(f10_13), S(f10_14), S(f10_15), S(f10_16), S(f10_17) };
const uint16_t pg_t10[] PROGMEM = { L10_01, L10_02, L10_03, L10_04, L10_05, L10_06, L10_07, L10_08, L10_09, L10_10, L10_11, L10_12, L10_13, L10_14, L10_15, L10_16, L10_17 };



// —Ú‡¯ËÈ ‡Áˇ‰ ‚ ‰ÎËÌÂ ˜‡ÒÚÓÚ˚ - ˝ÚÓ ÏÂ‡Ì‰
#define FREQ_MEANDR		0x8000

const uint8_t pg_01[] PROGMEM = "ÕŒ—Œ√ÀŒ“ ¿, –Œ“";

const uint8_t n01_01[] PROGMEM = "¿Õ√»Õ¿";
const double f01_01[] PROGMEM = { 36, 35, 86, 52, 89, 82, 87 };
#define l01_01 ( 60 * 3 )

const uint8_t n01_02[] PROGMEM = "—“ŒÃ¿“»“";
const double f01_02[] PROGMEM = { 465 };
#define l01_02 ( 60 * 10 )

const uint8_t n01_03[] PROGMEM = "Ã»Õƒ¿À»Õ€";
const double f01_03[] PROGMEM = { 727, 880, 787, 20, 802, 1550, 444, 776, 2720, 2160, 5000, 1, 13, 804, 784 };
#define l01_03 ( 60 * 1 )

const uint8_t n01_04[] PROGMEM = "≈¬—“¿’»≈¬€ “–”¡";
const double f01_04[] PROGMEM = { 27, 29, 727, 880, 787, 465, 802, 1550, 776 };
#define l01_04 ( 60 * 2 )

	const uint8_t np3[] PROGMEM = "“Œ —ŒœÀ¿«Ã¿";
	#define FP3					395000

	const uint8_t np4[] PROGMEM = "ÿ»—“Œ—ŒÃ¿ Ã¿Õ—.";
	#define FP4					353000

	const uint8_t np5[] PROGMEM = "ÿ»—“Œ—ŒÃ¿ ”–≈¿.";
	#define FP5					473000

	const uint8_t np6[] PROGMEM = "”–≈¿œÀ¿«Ã¿";
	#define FP6					756

	const uint8_t np7[] PROGMEM = "’À¿Ã»ƒ»ﬂ 1";
	#define FP7					381000

	const uint8_t np8[] PROGMEM = "’À¿Ã»ƒ»ﬂ 2";
	#define FP8					379700

	const uint8_t np9[] PROGMEM = "’À¿Ã»ƒ»ﬂ 3";
	#define FP9					383950

	const uint8_t np10[] PROGMEM = "“–»’ŒÃŒÕ¿ƒ¿ 1";
	#define FP10					381000

	const uint8_t np11[] PROGMEM = "“–»’ŒÃŒÕ¿ƒ¿ 2";
	#define FP11					370000

	const uint8_t np12[] PROGMEM = "“–»’ŒÃŒÕ¿ƒ¿ 3";
	#define FP12					383600

	const uint8_t np13[] PROGMEM = "Ã» ŒœÀ¿«¿Ã¿ œÕ1";
	#define FP13					323500

	const uint8_t np14[] PROGMEM = "Ã» ŒœÀ¿«¿Ã¿ œÕ2";
	#define FP14					346000

	const uint8_t np15[] PROGMEM = " À≈¡—»≈ÀÀ¿ œÕ 1";
	#define FP15					401000

	const uint8_t np16[] PROGMEM = " À≈¡—»≈ÀÀ¿ œÕ 2";
	#define FP16					419000

	const uint8_t np17[] PROGMEM = "’≈À» Œ¡¿ “≈– œ.";
	#define FP17					355000

	const uint8_t np18[] PROGMEM = "›’»ÕŒ Œ   √–. 1";
	#define FP18					457000

	const uint8_t np19[] PROGMEM = "›’»ÕŒ Œ   √–. 2";
	#define FP19					444000

	const uint8_t np20[] PROGMEM = "GARDNELLA VAG 1";
	#define FP20					340000

	const uint8_t np21[] PROGMEM = "GARDNELLA VAG 2";
	#define FP21					338000

	const uint8_t np22[] PROGMEM = "GARDNELLA VAG 3";
	#define FP22					342000

	const uint8_t np23[] PROGMEM = "ÀﬂÃ¡À»ﬂ “–ŒœŒ 1";
	#define FP23					424000

	const uint8_t np24[] PROGMEM = "ÀﬂÃ¡À»ﬂ “–ŒœŒ 2";
	#define FP24					421000

	const uint8_t np25[] PROGMEM = "ÀﬂÃ¡À»ﬂ “–ŒœŒ 3";
	#define FP25					426300
