#ifndef flash_freqs_h
#define flash_freqs_h

#include <avr/pgmspace.h>
#include <stdint.h>

#define S( a )	( (uint8_t)( sizeof( a ) / sizeof( a[0] ) ) )
#define P( x )	( (uint16_t)&x[0] )
#define K( x )	( (uint32_t)( x * 100.0 ) )


//******************************************
const uint8_t pg_01[] PROGMEM = "¿Õ»“œ¿–¿«»“¿–Õ.";

const uint8_t n01_01[] PROGMEM = "¿Õ“»œ¿–¿«. À¿– ";
const uint32_t f01_01[] PROGMEM = { K(30000.00), K(1600.00), K(30000.00), K(1600.00), K(30000.00), K(1600.00) };
#define L01_01 ( 200 )

const uint8_t n01_02[] PROGMEM = "¿Õ“»œ¿–¿«. Œ¡Ÿ.";
const uint32_t f01_02[] PROGMEM = { K(10000.00), K(5000.00), K(4412.00), K(2720.00), K(2400.00), 
K(2112.00), K(1864.00), K(1550.00), K(1360.00), K(880.00), K(854.00), 
K(800.00), K(784.00), K(751.00), K(732.00), K(728.00), K(712.00), 
K(688.00), K(651.00), K(644.00), K(524.00), K(465.00), K(442.00), 
K(422.00), K(334.00), K(240.00), K(152.00), K(128.00), K(125.00), 
K(120.00), K(112.00), K(96.00), K(72.00), K(64.00), K(20.00) };
#define L01_02 ( 42 )

const uint8_t n01_03[] PROGMEM = "¿Õ“»œ¿–¿«»“. F";
const uint32_t f01_03[] PROGMEM = { K(1522.00), K(829.00), K(827.00), K(749.00), K(732.00), 
K(605.00), K(967.00), K(741.00), K(854.00), K(524.00), K(172.00), 
K(942.00), K(422.00), K(633.00), K(411.00), K(604.00), K(591.00), 
K(4122.00), K(102.00), K(344.00) };
#define L01_03 ( 60 )

const uint8_t * const pg_n01[] PROGMEM = { n01_01, n01_02, n01_03, (uint8_t *)0 };
const uint32_t * const pg_f01[] PROGMEM = { f01_01, f01_02, f01_03 };
const uint8_t pg_j01[] PROGMEM = { S(f01_01), S(f01_02), S(f01_03) };
const uint16_t pg_t01[] PROGMEM = { L01_01, L01_02, L01_03 };

//******************************************
const uint8_t pg_02[] PROGMEM = "»Õ‘≈ ÷»»";

const uint8_t n02_01[] PROGMEM = "¿Õ“»¡¿ “≈–»¿À‹Õ";
const uint32_t f02_01[] PROGMEM = { K(727.00), K(880.00), K(787.00), K(20.00), K(465.00), 
K(802.00), K(1550.00), K(95.00), K(444.00), K(776.00), K(125.00), 
K(72.00), K(600.00), K(650.00), K(1600.00), K(625.00), K(666.00), 
K(690.00), K(1500.00), K(1865.00), K(832.00), K(440.00), K(428.00), 
K(660.00), K(760.00), K(450.00), K(700.00), K(500.00) };
#define L02_01 ( 53 )

const uint8_t n02_02[] PROGMEM = "¿Õ“»√–»¡ Œ¬¿ﬂ";
const uint32_t f02_02[] PROGMEM = { K(2222.00), K(1552.00), K(1550.00), K(1153.00), K(1134.00), 
K(1016.00), K(880.00), K(802.00), K(787.00), K(784.00), K(727.00), 
K(582.00), K(465.00), K(422.00), K(254.00), K(72.00), K(20.00), 
K(4442.00), K(2411.00), K(1833.00), K(1823.00), K(1333.00), K(1155.00), 
K(1130.00), K(942.00), K(933.00), K(886.00), K(866.00), K(774.00), 
K(766.00), K(745.00), K(743.00), K(728.00), K(623.00), K(594.00), 
K(592.00), K(565.00), K(555.00), K(524.00), K(512.00), K(464.00), 
K(414.00), K(374.00), K(344.00), K(337.00), K(321.00), K(242.00), 
K(222.00), K(158.00), K(132.00), K(823.00), K(824.00), K(825.00), 
K(826.00), K(827.00), K(828.00), K(829.00), K(331.00), K(336.00), 
K(587.00), K(632.00), K(688.00), K(757.00), K(882.00), K(884.00), K(887.00) };
#define L02_02 ( 22 )

const uint8_t n02_03[] PROGMEM = "√≈–œ≈—";
const uint32_t f02_03[] PROGMEM = { K(465.00), K(141.00), K(383.00), K(450.00), K(629.00), 
K(727.00), K(880.00), K(787.00), K(20.00), K(802.00), K(1550.00), 
K(2720.00), K(1600.00), K(1800.00), K(2160.00), K(1500.00), K(1865.00), 
K(100.00), K(200.00), K(1000.00) };
#define L02_03 ( 60 )

const uint8_t * const pg_n02[] PROGMEM = { n02_01, n02_02, n02_03, (uint8_t *)0 };
const uint32_t * const pg_f02[] PROGMEM = { f02_01, f02_02, f02_03 };
const uint8_t pg_j02[] PROGMEM = { S(f02_01), S(f02_02), S(f02_03) };
const uint16_t pg_t02[] PROGMEM = { L02_01, L02_02, L02_03 };

//******************************************
const uint8_t pg_03[] PROGMEM = "√–»œœ, Œ–¬»";

const uint8_t n03_01[] PROGMEM = "√–»œœ, Œ–¬»";
const uint32_t f03_01[] PROGMEM = { K(425.00), K(461.00), K(513.00), K(753.00), K(763.00), 
K(954.00), K(332.00), K(341.00), K(469.00), K(482.00), K(523.00), 
K(742.00), K(787.00), K(841.00), K(889.00) };
#define L03_01 ( 80 )

const uint8_t n03_02[] PROGMEM = "œ–Œ—“”ƒÕ€≈ «¿¡.";
const uint32_t f03_02[] PROGMEM = { K(727.00), K(880.00), K(787.00), K(20.00), K(465.00), 
K(802.00), K(1550.00), K(1.00), K(444.00), K(776.00), K(5.00) };
#define L03_02 ( 109 )

const uint8_t n03_03[] PROGMEM = "»ÃÃ”Õ»“≈“ —“»Ã.";
const uint32_t f03_03[] PROGMEM = { K(34100.00) };
#define L03_03 ( 1200 )

const uint8_t * const pg_n03[] PROGMEM = { n03_01, n03_02, n03_03, (uint8_t *)0 };
const uint32_t * const pg_f03[] PROGMEM = { f03_01, f03_02, f03_03 };
const uint8_t pg_j03[] PROGMEM = { S(f03_01), S(f03_02), S(f03_03) };
const uint16_t pg_t03[] PROGMEM = { L03_01, L03_02, L03_03 };

//******************************************
const uint8_t pg_04[] PROGMEM = "¿ÀÀ≈–√»ﬂ, ¿—“Ã¿";

const uint8_t n04_01[] PROGMEM = "¿Õ“»¿ÀÀ≈–√»◊≈— ";
const uint32_t f04_01[] PROGMEM = { K(36.00), K(20.50), K(82.00), K(31.50), K(95.50), 
K(84.00), K(73.50), K(58.00), K(91.50), K(73.00), K(58.30), 
K(12.50), K(75.00), K(64.80), K(37.50), K(58.50), K(57.00), 
K(11.50), K(74.50), K(53.50), K(17.00), K(60.00), K(27.50), 
K(727.00), K(880.00), K(787.00), K(465.00), K(10000.00), K(5000.00), K(330.00) };
#define L04_01 ( 50 )

const uint8_t n04_02[] PROGMEM = "¡–ŒÕ’»“ ¿—“Ã¿“.";
const uint32_t f04_02[] PROGMEM = { K(428.00), K(465.00), K(20.00), K(9.40), K(1.50), 
K(1.00), K(727.00), K(6.30), K(10.00), K(28.00), K(90.00), 
K(1.00), K(871.00), K(521.00), K(890.00), K(665.00), K(633.00), 
K(411.00), K(712.00), K(487.00), K(3124.00), K(3125.00), K(263.00), 
K(756.00), K(172.00), K(322.00), K(822.00), K(434.00), K(515.00), 
K(886.00), K(128.00), K(782.00) };
#define L04_02 ( 46 )

const uint8_t * const pg_n04[] PROGMEM = { n04_01, n04_02, (uint8_t *)0 };
const uint32_t * const pg_f04[] PROGMEM = { f04_01, f04_02 };
const uint8_t pg_j04[] PROGMEM = { S(f04_01), S(f04_02) };
const uint16_t pg_t04[] PROGMEM = { L04_01, L04_02 };

//******************************************
const uint8_t pg_05[] PROGMEM = "ÀŒ–";

const uint8_t n05_01[] PROGMEM = "¿Õ√»Õ¿";
const uint32_t f05_01[] PROGMEM = { K(360.00), K(35.00), K(86.00), K(52.00), K(89.00), 
K(82.00), K(87.00), K(787.00), K(776.00), K(727.00), K(465.00), 
K(428.00), K(660.00), K(3.00), K(230.00), K(2720.00), K(2160.00), 
K(1800.00), K(1600.00), K(1500.00), K(880.00), K(832.00), K(444.00), 
K(1865.00), K(125.00), K(95.00), K(72.00), K(20.00), K(14.00) };
#define L05_01 ( 51 )

const uint8_t n05_02[] PROGMEM = "¡–ŒÕ’»“";
const uint32_t f05_02[] PROGMEM = { K(32.50), K(46.00), K(76.50), K(86.00), K(92.00), 
K(1.20), K(73.00), K(880.00), K(727.00), K(9.40), K(9.35), 
K(32.50), K(46.00), K(76.50), K(86.00), K(92.00) };
#define L05_02 ( 75 )

const uint8_t n05_03[] PROGMEM = "√¿…ÃŒ–»“";
const uint32_t f05_03[] PROGMEM = { K(727.00), K(880.00), K(787.00), K(802.00), K(1550.00), 
K(125.00), K(72.00), K(522.00), K(85.00), K(90.00), K(98.00), 
K(79.00), K(86.00), K(62.00), K(53.00), K(69.00), K(58.00), 
K(26.00), K(74.00), K(57.00) };
#define L05_03 ( 60 )

const uint8_t n05_04[] PROGMEM = "Œ“»“";
const uint32_t f05_04[] PROGMEM = { K(43.00), K(44.00), K(9.60), K(95.00), K(7.80), K(98.00) };
#define L05_04 ( 200 )

const uint8_t * const pg_n05[] PROGMEM = { n05_01, n05_02, n05_03, n05_04, (uint8_t *)0 };
const uint32_t * const pg_f05[] PROGMEM = { f05_01, f05_02, f05_03, f05_04 };
const uint8_t pg_j05[] PROGMEM = { S(f05_01), S(f05_02), S(f05_03), S(f05_04) };
const uint16_t pg_t05[] PROGMEM = { L05_01, L05_02, L05_03, L05_04 };

//******************************************
const uint8_t pg_06[] PROGMEM = "œ–Œ¡À≈Ã€ ∆ “";

const uint8_t n06_01[] PROGMEM = "¬Œ—œ¿À≈Õ»≈ ∆ “";
const uint32_t f06_01[] PROGMEM = { K(20.00), K(146.00), K(522.00), K(727.00), K(787.00), 
K(880.00), K(10000.00), K(465.00), K(1500.00), K(1600.00), K(1800.00), 
K(2160.00), K(2720.00), K(5000.00), K(428.00), K(660.00), K(776.00), 
K(4.90), K(1.20), K(1.50), K(1.00), K(5.80), K(3.90), 
K(6.30), K(800.00), K(10.00), K(15.00), K(12.00) };
#define L06_01 ( 53 )

const uint8_t n06_02[] PROGMEM = "ƒ»¿–≈ﬂ,  ŒÀ»“";
const uint32_t f06_02[] PROGMEM = { K(152.00), K(344.00), K(433.00), K(454.00), K(621.00), 
K(1550.00), K(880.00), K(727.00), K(787.00), K(465.00), K(5000.00) };
#define L06_02 ( 109 )

const uint8_t n06_03[] PROGMEM = "¬Œ—œ.¡–ﬁÿÕ.œŒÀ.";
const uint32_t f06_03[] PROGMEM = { K(727.00), K(880.00), K(787.00), K(20.00), K(465.00), 
K(802.00), K(1550.00), K(95.00), K(444.00), K(776.00), K(125.00), 
K(72.00), K(2720.00), K(1600.00), K(1800.00), K(2160.00), K(5000.00), 
K(146.00), K(1865.00), K(832.00), K(440.00), K(2489.00), K(450.00), K(380.00) };
#define L06_03 ( 60 )

const uint8_t * const pg_n06[] PROGMEM = { n06_01, n06_02, n06_03, (uint8_t *)0 };
const uint32_t * const pg_f06[] PROGMEM = { f06_01, f06_02, f06_03 };
const uint8_t pg_j06[] PROGMEM = { S(f06_01), S(f06_02), S(f06_03) };
const uint16_t pg_t06[] PROGMEM = { L06_01, L06_02, L06_03 };

//******************************************
const uint8_t pg_07[] PROGMEM = "¡ŒÀ‹,¬Œ—œ¿À≈Õ»≈";

const uint8_t n07_01[] PROGMEM = "¬Œ—œ¿À.& ƒ–≈Õ¿∆";
const uint32_t f07_01[] PROGMEM = { K(69.00), K(68.50), K(73.50), K(21.50), K(58.00), 
K(27.00), K(75.00), K(46.00), K(79.50), K(32.00), K(11.00), 
K(50.00), K(11.50), K(20.00), K(1.50), K(4.90) };
#define L07_01 ( 75 )

const uint8_t n07_02[] PROGMEM = "“–¿¬Ã€, ”ÿ»¡€";
const uint32_t f07_02[] PROGMEM = { K(8.10), K(86.00), K(97.50), K(0.70), K(0.90), 
K(2.50), K(2.65), K(3.30), K(9.80), K(56.00), K(69.00), 
K(1.20), K(3.60), K(3.80), K(3.90), K(8.60), K(92.00), 
K(3040.00), K(95.00), K(190.00), K(760.00), K(880.00), K(787.00), 
K(727.00), K(465.00), K(9.10), K(110.00) };
#define L07_02 ( 55 )

const uint8_t n07_03[] PROGMEM = "À»Ã‘Œƒ–≈Õ¿∆";
const uint32_t f07_03[] PROGMEM = { K(10000.00), K(3177.00), K(3176.00), K(3175.00), K(880.00), 
K(787.00), K(751.00), K(727.00), K(676.00), K(635.00), K(625.00), 
K(522.00), K(465.00), K(444.00), K(440.00), K(304.00), K(148.00), 
K(146.00), K(15.20), K(15.05), K(10.36), K(10.00), K(7.83), 
K(6.30), K(2.50), K(67.50), K(15.00), K(37.50), K(38.00), 
K(38.50), K(20.50), K(94.50), K(43.50), K(88.00), K(62.00), 
K(6.30), K(25.50) };
#define L07_03 ( 40 )

const uint8_t n07_04[] PROGMEM = "¿–“–»“";
const uint32_t f07_04[] PROGMEM = { K(64.00), K(78.00), K(100.00), K(58.50), K(88.50), 
K(54.00), K(9.60), K(1.20), K(1.60), K(9.20), K(64.50), 
K(99.00), K(56.00), K(88.00), K(2.65), K(6.80), K(9.40), 
K(9.70), K(8.10), K(46.00), K(69.00), K(2.50), K(3.60), 
K(3.80), K(3.90), K(79.00), K(7.80), K(10.00), K(28.00), 
K(10000.00), K(1550.00), K(880.00), K(802.00), K(787.00), K(727.00), 
K(465.00), K(20.00), K(7.70), K(3.00), K(6.40), K(2720.00), 
K(250.00), K(650.00), K(625.00), K(600.00), K(30.00) };
#define L07_04 ( 32 )

const uint8_t * const pg_n07[] PROGMEM = { n07_01, n07_02, n07_03, n07_04, (uint8_t *)0 };
const uint32_t * const pg_f07[] PROGMEM = { f07_01, f07_02, f07_03, f07_04 };
const uint8_t pg_j07[] PROGMEM = { S(f07_01), S(f07_02), S(f07_03), S(f07_04) };
const uint16_t pg_t07[] PROGMEM = { L07_01, L07_02, L07_03, L07_04 };


//*******************************************
const uint8_t * const pg_menu[] PROGMEM = { pg_01, pg_02, pg_03, pg_04, pg_05, pg_06, pg_07, (uint8_t *)0 };

const uint16_t pg_names[] PROGMEM = { P(pg_n01), P(pg_n02), P(pg_n03), P(pg_n04), P(pg_n05), P(pg_n06), P(pg_n07) };

const uint16_t pg_freqs[] PROGMEM = { P(pg_f01), P(pg_f02), P(pg_f03), P(pg_f04), P(pg_f05), P(pg_f06), P(pg_f07) };

const uint16_t pg_nums[] PROGMEM = { P(pg_j01), P(pg_j02), P(pg_j03), P(pg_j04), P(pg_j05), P(pg_j06), P(pg_j07) };

const uint16_t pg_secs[] PROGMEM = { P(pg_t01), P(pg_t02), P(pg_t03), P(pg_t04), P(pg_t05), P(pg_t06), P(pg_t07) };



#define razdel_names( razdel )		( (uint16_t *)pgm_read_word( &pg_names[ razdel ] ) )
#define razdel_nums( razdel )		( (uint8_t *)pgm_read_word( &pg_nums[ razdel ] ) )
#define razdel_secs( razdel )		( (uint16_t *)pgm_read_word( &pg_secs[ razdel ] ) )
#define razdel_freqs( razdel )		( (uint16_t *)pgm_read_word( &pg_freqs[ razdel ] ) )


#define prog_name( razdel, i )		( (uint8_t *)pgm_read_word( &razdel_names( razdel )[i] ) )
#define prog_sec( razdel, i )		( (uint16_t)pgm_read_word( &razdel_secs( razdel )[i] ) )
#define prog_num( razdel, i )		( (uint8_t)pgm_read_byte( &razdel_nums( razdel )[i] ) )
#define prog_freqs( razdel, i )		( (uint32_t *)pgm_read_word( &razdel_freqs( razdel )[i] ) )


#endif
